In [1]:
import pandas as pd
import numpy as np

In [2]:
obj = pd.Series([4,7,-5,3],index = ['d','b','a','c'])

In [3]:
obj.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [4]:
obj['d'] = 6
obj[['c','a','d']]

c    3
a   -5
d    6
dtype: int64

In [5]:
data = {'state':['Ohio','Ohio','Ohio','Nevada','Navada'],
       'year':[2000,2001,2002,2001,2002],
       'pop':[1.5,1.7,3.6,2.4,2.9]}
frame = pd.DataFrame(data,columns = ['year','state','pop','debt'],index = ['one','two','three','four','five'])
frame

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Navada  2.9  NaN

In [6]:
frame.year # frame['year'] (等价)
frame.loc['three'] # frame.iloc[2](等价)

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [7]:
frame['debt'] = np.arange(5.)
frame['eastern'] = frame.state == 'Ohio'
frame
del frame['eastern']
frame

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Navada  2.9   4.0

##### index object

In [8]:
obj = pd.Series(range(3),index = ['a','b','c'])
obj

a    0
b    1
c    2
dtype: int32

In [9]:
index = obj.index # index 不可更改
index = pd.Index(np.arange(3))
index

Int64Index([0, 1, 2], dtype='int64')

In [10]:
'three' in frame.index # 查看是否在index里

True

In [11]:
#reindex
obj.reindex(['a','b','c','d'],fill_value = 0) # d 不存在，用0代替np.Nan

a    0
b    1
c    2
d    0
dtype: int32

In [12]:
obj3 = pd.Series(['blue','purple','yellow'],index= [0,2,4])
obj3.reindex(range(6),method = 'ffill') #向前填充

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [16]:
frame = pd.DataFrame(np.arange(9).reshape(3,3),index = ['a','c','d'],columns = ['Ohio','Texas','California'])

In [24]:
states = ['Texas','Utah','California']
frame.reindex(index = ['a','b','c','d'],method='ffill').reindex(columns = states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [25]:
frame.loc[['a','b','c','d'],['Texas']]

   Texas
a    1.0
b    NaN
c    4.0
d    7.0